#!/bin/bash

for ((i = 1; i <= 15; i++)) do
    ./app.exe < ./tests/in_"$i".txt > kids.txt
    
        if cmp -s kids.txt ./tests/out_"$i".txt; then
            if (("$i" == 1)); then
                echo тест "("happy path")" № "$i" пройден
            elif (("$i" == 2)); then
                echo тест "("удаление + сортировка по ключу SEX")" № "$i" пройден
            elif (("$i" == 3)); then
                echo тест "("удаление + сортировка по ключу BIRTHDATE")" № "$i" пройден
            elif (("$i" == 4)); then
                echo тест "("удаление + сортировка по ключу SURNAME")" № "$i" пройден
            elif (("$i" == 5)); then
                echo тест "("удаление + сортировка по ключу GRADE")" № "$i" пройден
            elif (("$i" == 6)); then
                echo тест "("кол-во оценок равно 0")" № "$i" пройден
            elif (("$i" == 7)); then
                echo тест "("некоректно введен пол")" № "$i" пройден
            elif (("$i" == 8)); then
                echo тест "("некоректно введен ключ "("неправильное название")"")" № "$i" пройден
            elif (("$i" == 8)); then
                echo тест "("некоректно введен ключ "("неправильное название")"")" № "$i" пройден
            elif (("$i" == 9)); then
                echo тест "("некоректно введен ключ "("неправильный регистр")"")" № "$i" пройден
            elif (("$i" == 10)); then
                echo тест "("присутвствуют несуществующие оценки"("20, -2 и т.д.")"")" № "$i" пройден
            elif (("$i" == 11)); then
                echo тест "("неправильный формат даты")" № "$i" пройден
            elif (("$i" == 12)); then
                echo тест "("нет данных, только nobody")" № "$i" пройден    
            elif (("$i" == 13)); then
                echo тест "("вместо строки "\n"")" № "$i" пройден   
            elif (("$i" == 14)); then
                echo тест "("вместо строки мусор")" № "$i" пройден
            elif (("$i" == 15)); then
                echo тест "("удаление всех строк")" № "$i" пройден
            elif (("$i" == 16)); then
                echo тест "("младенец в списке")" № "$i" пройден
            elif (("$i" == 17)); then
                echo тест "("пожилой человек в списке")" № "$i" пройден         
            fi
        else
            if (("$i" == 1)); then
                echo тест "("happy path")" № "$i" не пройден
            elif (("$i" == 2)); then
                echo тест "("удаление + сортировка по ключу SEX")" № "$i" не пройден
            elif (("$i" == 3)); then
                echo тест "("удаление + сортировка по ключу BIRTHDATE")" № "$i" не пройден
            elif (("$i" == 4)); then
                echo тест "("удаление + сортировка по ключу SURNAME")" № "$i" не пройден
            elif (("$i" == 5)); then
                echo тест "("удаление + сортировка по ключу GRADE")" № "$i" не пройден
            elif (("$i" == 6)); then
                echo тест "("кол-во оценок равно 0")" № "$i" не пройден
            elif (("$i" == 7)); then
                echo тест "("некоректно введен пол")" № "$i" не пройден
            elif (("$i" == 8)); then
                echo тест "("некоректно введен ключ "("неправильное название")"")" № "$i" не пройден
            elif (("$i" == 9)); then
                echo тест "("некоректно введен ключ "("неправильный регистр")"")" № "$i" не пройден
            elif (("$i" == 10)); then
                echo тест "("присутвствуют несуществующие оценки"("20, -2 и т.д.")"")" № "$i" не пройден
            elif (("$i" == 11)); then
                echo тест "("неправильный формат даты")" № "$i" не пройден
            elif (("$i" == 12)); then
                echo тест "("нет данных, только nobody")" № "$i" не пройден   
            elif (("$i" == 13)); then
                echo тест "("вместо строки "\n"")" № "$i" не пройден     
            elif (("$i" == 14)); then
                echo тест "("вместо строки мусор")" № "$i" не пройден
            elif (("$i" == 15)); then
                echo тест "("удаление всех строк")" № "$i" не пройден
            elif (("$i" == 16)); then
                echo тест "("младенец в списке")" № "$i" не пройден
            elif (("$i" == 17)); then
                echo тест "("пожилой человек в списке")" № "$i" не пройден        
            fi
        echo фактический результат:
        cat kids.txt
        echo ожидаемый результат:
        cat ./tests/out_"$i".txt
        echo -e "\n"
        fi
done
