# Вычисление обьема, площади поверхности шарового сегмента.

# Савинов Егор ИУ7-14Б

# V - Объем шарового сегмента
# S - Площадь поверхности шарового сегмента
# R - радиус шара
# H - высота шарового сегмента

from math import pi

R, H = map(float, input('\nВведите радиус шара, высоту шарового сегмента = ')\
           .split())

if R <= 0 or H <= 0 or R < H:
    print('\nОшибка ввода величины')

else:
    r = (R * R) - ((R-H) ** 2)
    V = pi * H ** 2 * (R - (1/3 * H))
    S = 2 * R * H * pi
    S_1 = 2 * pi * R * H + pi * r * r

    print('\nV = {:.5g}'.format(V), '\nS = {:.5g}'.format(S), \
          '\nS_1 = {:.5g}'.format(S_1))

input('\nPress ENTER to exit')
